In [ ]:
import sqlite3 as sql

# create a connection with a database
conn = sql.connect('idrees.db')

# create a cursor object using the connection - allows us to go through the records
cursor = conn.cursor()

In [ ]:
cursor.execute('''
CREATE TABLE people(
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL, 
    age INTEGER,
    city TEXT
);
''')

OperationalError: table people already exists

In [15]:
conn.commit()  # save the changes

In [12]:
cursor.execute('''
INSERT INTO people (name, age, city) VALUES ('John Doe', 30, 'New York');
''')

In [28]:
cursor.execute('''
INSERT INTO people (name, age, city) VALUES ('Rezel', 28, 'Ambala');
''')

conn.commit()  # save the changes

In [29]:
cursor.execute('''
               SELECT * FROM people;
               ''')

results = cursor.fetchall()  # fetch all the records

In [30]:
import pandas as pd

df = pd.DataFrame(results)
df

   0              1   2            3
0  1       John Doe  30     New York
1  2     Jane Smith  25  Los Angeles
2  3  Alice Johnson  28      Chicago
3  4  Alice Johnson  28      Chicago
4  5  Alice Johnson  28      Chicago
5  6  Alice Johnson  28      Chicago
6  7           Nehu  28      Chicago
7  8        Kanchan  28       Ambala
8  9          Rezel  28       Ambala

In [38]:
# close the connection
conn.close()

In [42]:
# mySQL connect

import mysql.connector

connection = mysql.connector.connect(
    host='localhost',
    user='idrees',
    password='password',
    database='idrees'
);

cursor = connection.cursor()

DatabaseError: 2003 (HY000): Can't connect to MySQL server on 'localhost:3306' (10061)

In [18]:
INSERT INTO people (name, age, city) VALUES ('John Doe', 30, 'New York');
INSERT INTO people (name, age, city) VALUES ('Jane Smith', 25, 'Los Angeles');
INSERT INTO people (name, age, city) VALUES ('Alice Johnson', 28, 'Chicago');

SyntaxError: invalid syntax (1823814278.py, line 1)

In [1]:
CREATE TABLE people(
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    age INTEGER,
    city TEXT
);

SyntaxError: invalid syntax (126609417.py, line 1)